read_verilog -Ifir -Ifft -sv top.v
synth_xilinx -top top
hilomap -hicell VCC P -locell GND G
write_edif -nogndvcc top.edif
